luke-jr/BitForce_SC/BitForce_SC/AVR32X/AVR32_Module.c
/*
 * AVR32_Module.c
 *
 * Created: 21/11/2012 20:58:33
 *  Author: NASSER GHOSEIRI
 * Company: Butterfly Labs
 */ 

#include <avr32/io.h>
#include "intc.h"
#include "../std_defs.h"
#include "AVR32_Module.h"

//////////////////////////////////////////////
// FUNCTIONS
/////////////////////////////////////////////

#define XLINK_activate_address_increase     AVR32_GPIO.port[1].ovrs  = __AVR32_CPLD_INCREASE_ADDRESS;
#define XLINK_deactivate_address_increase   AVR32_GPIO.port[1].ovrc  = __AVR32_CPLD_INCREASE_ADDRESS;


// General MCU Functions
void __AVR32_LowLevelInitialize()
{
	// ********* Enable OSC0
	AVR32_MCCTRL  |= 0b100; // OSC0EN = 1
	AVR32_CKSEL   = 0; // All Clocks equal main-clock
	AVR32_OSCCTRL0 = 0b00000000000000000000000100000111;
	
	// Enable watchdog to reset the system if PLL fails
	AVR32_WDT.ctrl = (0x055000000) | (0b0111100000000) | 0b01; // Timeout is set to 142ms
	NOP_OPERATION;
	AVR32_WDT.ctrl = (0x0AA000000) | (0b0111100000000) | 0b01;
	NOP_OPERATION;
	AVR32_WDT.clr = 0x0FFFFFFFF;

	// Wait until it's active (1 << 7 is OSC0 Status bit)
	while ((AVR32_POSCSR & (1 << 7)) == 0);

	#if defined(__OPERATING_FREQUENCY_32MHz__)
		// ********* Enable PLL0
		// Value for PLL0 is 00011111    00000111    00000100   -----------00000101----------
		//                   PLLCNT=31   PLLMUL=7+1  PLLDIV=4   PLLOPT=001, PLLOSC=1, PLLEN=1
		#if defined(__PRODUCT_MODEL_SINGLE__) || defined(__PRODUCT_MODEL_MINIRIG__) // Remember, here the XTAL is 12MHz
			AVR32_PLL0 = 0b00011111000010100000010000000101; // PLL0 at 32MHz
		#else
			AVR32_PLL0 = 0b00011111000001110000010000000101; // PLL0 at 32MHz
		#endif
	#elif defined(__OPERATING_FREQUENCY_64MHz__)
		// ********* Enable PLL0
		// Value for PLL0 is 00011111    00000111    0000010   -----------00000101----------
		//                   PLLCNT=31   PLLMUL=7+1  PLLDIV=2   PLLOPT=001, PLLOSC=0, PLLEN=1
		#if defined(__PRODUCT_MODEL_SINGLE__) || defined(__PRODUCT_MODEL_MINIRIG__) // Remember, here the XTAL is 12MHz
			AVR32_PLL0 = 0b00011111000010100000001000000101; // PLL0 at 64MHz
		#else
			AVR32_PLL0 = 0b00011111000001110000001000000101; // PLL0 at 64MHz
		#endif		 	   
		
		// Set wait-state to 1
		AVR32_FLASHC_MAIN = ((1 << 8) | (1 << 6)) | 0x00000000;
		
	#elif defined(__OPERATING_FREQUENCY_48MHz__)
		// ********* Enable PLL0
		// Value for PLL0 is 00011111    00000011    00000000   -----------00000101----------
		//                   PLLCNT=31   PLLMUL=3+1  PLLDIV=0   PLLOPT=000, PLLOSC=1, PLLEN=1
		AVR32_PLL0 = 0b00011111000010000000010000000101; // PLL0 at 48MHz		
	#elif defined(__OPERATING_FREQUENCY_16MHz__)
		// ********* Enable PLL0
		// Value for PLL0 is 00011111    00000011    00000000   -----------00000101----------
		//                   PLLCNT=31   PLLMUL=3+1  PLLDIV=0   PLLOPT=001, PLLOSC=1, PLLEN=1
		AVR32_PLL0 = 0b00011111000001110000010000000101; // PLL0 at 32MHz (same as the first mode here, as the PLL will not be used)
	#endif


	// Wait until PLL0 is stable (1 is PLL0 LOCK status bit)
	while ((AVR32_POSCSR & (1)) == 0);
	
	// Disable watchdog to reset the system if PLL fails
	/*AVR32_WDT.ctrl = (0x055000000) | (0b0101000000000) | 0b00;
	NOP_OPERATION;
	AVR32_WDT.ctrl = (0x0AA000000) | (0b0101000000000) | 0b00;
	NOP_OPERATION;*/

	// ********* Activate Generic clock
	#if defined(__OPERATING_FREQUENCY_32MHz__)
		AVR32_GCCTRL = 0b00000000000000000000000000000110; // This is for 32MHz, with DIVEN=0
		// Second bit in this block is our PLL-SEL=1, OSCSEL=0, DIVEN=0, DIV=0
	#elif defined(__OPERATING_FREQUENCY_64MHz__)
		AVR32_GCCTRL = 0b00000000000000000000000000000110; // This is for 64MHz, with DIVEN=0
		// Second bit in this block is our PLL-SEL=1, OSCSEL=0, DIVEN=0, DIV=0
	#elif defined(__OPERATING_FREQUENCY_48MHz__)
		AVR32_GCCTRL = 0b00000000000000000000000000000110; // This is for 48MHz, with DIVEN=0 (thus 48MHz for the IO)
		// Second bit in this block is our PLL-SEL=1, OSCSEL=0, DIVEN=0, DIV=0		
	#elif defined(__OPERATING_FREQUENCY_16MHz__)
		AVR32_GCCTRL = 0b00000000000000000000000000000100; // This is for 16MHz, with DIVEN=0
		// Second bit in this block is our PLL-SEL=0, OSCSEL=0, DIVEN=0, DIV=0
	#endif

	// ********* Switch system to the new clock
	#if defined(__OPERATING_FREQUENCY_16MHz__)
		AVR32_MCCTRL |= 0b01; 	// MCSEL = 1 -- OSC0 Selected
	#elif defined(__OPERATING_FREQUENCY_32MHz__)
		AVR32_MCCTRL |= 0b010; 	// MCSEL = 1 -- PLL0 Selected
	#elif defined(__OPERATING_FREQUENCY_64MHz__)
		AVR32_MCCTRL |= 0b010; 	// MCSEL = 1 -- PLL0 Selected		
	#elif defined(__OPERATING_FREQUENCY_48MHz__)
		AVR32_MCCTRL |= 0b010; 	// MCSEL = 1 -- PLL0 Selected			
	#endif
			
	// Wait a little, until everything is stable...
	volatile int i_delay = 0;
	while (i_delay < 8000) i_delay++;

	// OK, System is running at oscillator frequency ( i.e. 16MHz)
	i_delay += 1;
}

// A2D Functions
void  __AVR32_A2D_Initialize()
{
	// Initialize A2D unit
	AVR32_A2D_MODE_REGISTER = MAKE_DWORD(0b00001000, // Setup/Hold Time = 1000 (binary)
										0b00001000, // Statup Time = 1000 (binar)
										0b00001001, // PRESCALE set to 9 (effect is (9+1) * 2 = 20)
										0b00000000); // No Trigger, resultion = 10 bits, no RESET or SLEEP
	
	// Enable A2D Channel
	AVR32_A2D_CHANNEL_ENABLE_REGISTER = MAKE_DWORD(0b00000000,
												   0b00000000,
												   0b00000000,
												   (1<<AVR32_A2D_TEMP1_CHANNEL) |
												   (1<<AVR32_A2D_TEMP2_CHANNEL) |
												   (1<<AVR32_A2D_VCHANNEL_3P3V) |
												   (1<<AVR32_A2D_VCHANNEL_1V)   |
												   (1<<AVR32_A2D_VCHANNEL_PWR_MAIN)); // Enables channel 1 by default (CORRECT THIS!)
}

void  __AVR32_A2D_SetAccess()
{
	// Nothing special for this function
	return;
}

volatile int __AVR32_A2D_GetTemp1 ()
{
	// Activate the channel
	AVR32_A2D_CHANNEL_ENABLE_REGISTER = MAKE_DWORD(0b00000000,
												   0b00000000,
												   0b00000000,
												   (1<<AVR32_A2D_TEMP1_CHANNEL)); // Enables channel 1 by default (CORRECT THIS!)
	// Initiate Conversion
	AVR32_A2D_CONTROL_REGISTER |= (0b010); // Second-Bit activates the START command... thus conversion will start

