luke-jr/BitForce_SC/BitForce_SC/AVR32X/AVR32_Module.c
	// Keep reading until the channel is ready
	volatile unsigned int a2d_val = 0;

	// Wait until conversion finishes
	while ((AVR32_A2D_CHANNEL_STATUS_REGISTER & MAKE_DWORD(0,0,0,(1<<AVR32_A2D_TEMP1_CHANNEL))) == 0x0); // Wait until the conversion finishes

	// Read the value
	a2d_val = AVR32_A2D_TEMP1_CHANNEL_CDR;

	// Make correct AND operation
	a2d_val &= 0b01111111111;

	// Now, the A2D converter will give between 0b0000000000 and 0b1111111111.
	// Each LSB in the A2D range means 3.2 mV. To get the real voltage
	volatile float voltage_value = 3.2f * a2d_val;

	// Now we have the voltage.
	// Convert the returned value into temperature
	// Note that 500mV means 0 degrees (that's our offset there...), and each 10mV equals one degree
	volatile float res = ((voltage_value - 500) / 10);

	// We're done
	return (int)res;
}

volatile int __AVR32_A2D_GetTemp2 ()
{
	// Activate the channel
	AVR32_A2D_CHANNEL_ENABLE_REGISTER = MAKE_DWORD(0b00000000,
													0b00000000,
													0b00000000,
													(1<<AVR32_A2D_TEMP2_CHANNEL)); // Enables channel 1 by default (CORRECT THIS!)

	// Initiate Conversion
	AVR32_A2D_CONTROL_REGISTER |= (0b010); // Second-Bit activates the START command... thus conversion will start
	
	// Keep reading until the channel is ready
	volatile unsigned int a2d_val = 0;
	
	// Wait until conversion finishes
	while ((AVR32_A2D_CHANNEL_STATUS_REGISTER & MAKE_DWORD(0,0,0,(1<<AVR32_A2D_TEMP2_CHANNEL))) == 0x0); // Wait until the conversion finishes
	
	// Read the value
	a2d_val = AVR32_A2D_TEMP2_CHANNEL_CDR;
	
	// Make correct AND operation
	a2d_val &= 0b01111111111;
	
	// Now, the A2D converter will give between 0b0000000000 and 0b1111111111.
	// Each LSB in the A2D range means 3.2 mV. To get the real voltage
	volatile float voltage_value = 3.2f * a2d_val;
	
	// Now we have the voltage.	
	// Convert the returned value into temperature
	// Note that 500mV means 0 degrees (that's our offset there...), and each 10mV equals one degree
	volatile float res = ((voltage_value - 500) / 10);
	
	// We're done
	return (int)res;
}

volatile int __AVR32_A2D_Get3P3V  ()
{
	// Activate the channel
	AVR32_A2D_CHANNEL_ENABLE_REGISTER = MAKE_DWORD(0b00000000,
		0b00000000,
		0b00000000,
		(1<<AVR32_A2D_VCHANNEL_3P3V)); // Enables channel 1 by default (CORRECT THIS!)
		
	// Initiate Conversion
	AVR32_A2D_CONTROL_REGISTER |= (0b010); // Second-Bit activates the START command... thus conversion will start
	
	// Keep reading until the channel is ready
	volatile unsigned int a2d_val = 0;
	
	// Wait until conversion finishes
	while ((AVR32_A2D_CHANNEL_STATUS_REGISTER & MAKE_DWORD(0,0,0,(1<<AVR32_A2D_VCHANNEL_3P3V))) == 0x0); // Wait until the conversion finishes
	
	// Read the value
	a2d_val = AVR32_A2D_VCHANNEL_3P3V_CDR;
	
	// Make correct AND operation
	a2d_val &= 0b01111111111;
	
	// Now, the A2D converter will give between 0b0000000000 and 0b1111111111.
	// Each LSB in the A2D range means 3.2 mV. To get the real voltage
	volatile float voltage_value = 3.2f * a2d_val;
	
	// Now we have the voltage.
	return (int)voltage_value;
}

volatile int __AVR32_A2D_Get1V()
{
	// Activate the channel
	AVR32_A2D_CHANNEL_ENABLE_REGISTER = MAKE_DWORD(0b00000000,
		0b00000000,
		0b00000000,
		(1<<AVR32_A2D_VCHANNEL_1V)); // Enables channel 1 by default (CORRECT THIS!)
		
	// Initiate Conversion
	AVR32_A2D_CONTROL_REGISTER |= (0b010); // Second-Bit activates the START command... thus conversion will start
	
	// Keep reading until the channel is ready
	volatile unsigned int a2d_val = 0;
	
	// Wait until conversion finishes
	while ((AVR32_A2D_CHANNEL_STATUS_REGISTER & MAKE_DWORD(0,0,0,(1<<AVR32_A2D_VCHANNEL_1V))) == 0x0); // Wait until the conversion finishes
	
	// Read the value
	a2d_val = AVR32_A2D_VCHANNEL_1V_CDR;
	
	// Make correct AND operation
	a2d_val &= 0b01111111111;
	
	// Now, the A2D converter will give between 0b0000000000 and 0b1111111111.
	// Each LSB in the A2D range means 3.2 mV. To get the real voltage
	volatile float voltage_value = 3.2f * a2d_val;

	// We're done
	return (int)voltage_value;
}

volatile int __AVR32_A2D_GetPWR_MAIN()
{
	// Activate the channel
	AVR32_A2D_CHANNEL_ENABLE_REGISTER = MAKE_DWORD(0b00000000,
													0b00000000,
													0b00000000,
													(1<<AVR32_A2D_VCHANNEL_PWR_MAIN)); // Enables channel 1 by default (CORRECT THIS!)
				
	// Initiate Conversion
	AVR32_A2D_CONTROL_REGISTER |= (0b010); // Second-Bit activates the START command... thus conversion will start
	
	// Keep reading until the channel is ready
	volatile unsigned int a2d_val = 0;
	
	// Wait until conversion finishes
	while ((AVR32_A2D_CHANNEL_STATUS_REGISTER & MAKE_DWORD(0,0,0,(1<<AVR32_A2D_VCHANNEL_PWR_MAIN))) == 0x0); // Wait until the conversion finishes
	
	// Read the value
	a2d_val = AVR32_A2D_VCHANNEL_PWR_MAIN_CDR;
	
	// Make correct AND operation
	a2d_val &= 0b01111111111;
	
	// Now, the A2D converter will give between 0b0000000000 and 0b1111111111.
	// Each LSB in the A2D range means 3.2 mV. To get the real voltage
	volatile float voltage_value = 3.2f * a2d_val;
	
	// We're done
	return (int)voltage_value;
}

/////////////////////////////////////////////
// USB Chip Functions
/////////////////////////////////////////////
volatile void __AVR32_USB_Initialize()
{
	// Enable GPIOs on Port A
	AVR32_GPIO.port[0].gpers =  __AVR32_USB_AD0 | __AVR32_USB_AD1 | __AVR32_USB_AD2 | __AVR32_USB_AD3 |
								__AVR32_USB_AD4 | __AVR32_USB_AD5 | __AVR32_USB_AD6 | __AVR32_USB_AD7 |
								__AVR32_USB_WR  | __AVR32_USB_RD;
	
	AVR32_GPIO.port[0].oders = 	__AVR32_USB_WR	| __AVR32_USB_RD;
	AVR32_GPIO.port[0].ovrs =   __AVR32_USB_WR	| __AVR32_USB_RD;
	
	// Enable GPIOs on Port C
	AVR32_GPIO.port[2].gpers =  __AVR32_USB_SIWUA |	__AVR32_USB_A0 | __AVR32_USB_CS;
	AVR32_GPIO.port[2].oders =  __AVR32_USB_SIWUA |	__AVR32_USB_A0 | __AVR32_USB_CS;
	
	// Permanently select this chip
	AVR32_GPIO.port[0].ovrc  =  __AVR32_USB_A0;
}

volatile void __AVR32_USB_SetAccess()
{
	// No conditional access here, we simply return...
	return;
}

