luke-jr/BitForce_SC/BitForce_SC/AVR32X/AVR32_Module.c
volatile char __AVR32_USB_WriteData(char* iData, unsigned int iCount)
{
	// Return if we're zero
	if (iCount == 0) return 0;
	
	// Write data...
	AVR32_GPIO.port[0].oders =  __AVR32_USB_AD0 | __AVR32_USB_AD1 | __AVR32_USB_AD2 | __AVR32_USB_AD3 |
								__AVR32_USB_AD4 | __AVR32_USB_AD5 | __AVR32_USB_AD6 | __AVR32_USB_AD7;
	NOP_OPERATION;
	
	for (unsigned int vx = 0; vx < iCount; vx++)
	{
		// Is there space available?
		if ((__AVR32_USB_GetInformation() & 0b010) == FALSE) 
		{
			// Activate Send Immediate and wait until data is sent
			__AVR32_USB_FlushOutputData();
			
			
			// Wait until there is space available (With a countdown)			
			volatile unsigned int iRevCounter = 0x0010F0000;
			while ((iRevCounter-- > 0) && ((__AVR32_USB_GetInformation() & 0b010) == FALSE))
			{
				// Do nothing
			}
		
			// Did we timeout? If so, break
			if (iRevCounter == 0) break;
		}			
		
		// Write data
		AVR32_GPIO.port[0].ovr  = (AVR32_GPIO.port[0].ovr & 0x0FFFFFF00) | iData[vx];
		NOP_OPERATION;
		AVR32_GPIO.port[0].ovrc = __AVR32_USB_WR;
		NOP_OPERATION;
		AVR32_GPIO.port[0].ovrs = __AVR32_USB_WR;
		NOP_OPERATION;
		
	}
	
	// Disable output drivers on bus lines
	AVR32_GPIO.port[0].oderc =  __AVR32_USB_AD0 | __AVR32_USB_AD1 |	__AVR32_USB_AD2 | __AVR32_USB_AD3 |
								__AVR32_USB_AD4 | __AVR32_USB_AD5 |	__AVR32_USB_AD6 | __AVR32_USB_AD7;
	NOP_OPERATION;
	// Return
	return iCount;
}

volatile int  __AVR32_USB_GetInformation()
{
	// Save actual port state
	volatile int iActualPortState = (AVR32_GPIO.port[0].oder & 0x0FF);
	volatile int iRetVal = 0;
	
	// Write data...
	AVR32_GPIO.port[0].oderc =  __AVR32_USB_AD0 | __AVR32_USB_AD1 |	__AVR32_USB_AD2 | __AVR32_USB_AD3 |
								__AVR32_USB_AD4 | __AVR32_USB_AD5 |	__AVR32_USB_AD6 | __AVR32_USB_AD7;
	NOP_OPERATION;
									
	// Set A0
	AVR32_GPIO.port[2].ovrs =  __AVR32_USB_A0;
	NOP_OPERATION;
	
	// Get the value
	AVR32_GPIO.port[0].ovrc = __AVR32_USB_RD;
	NOP_OPERATION;
	iRetVal  = ((AVR32_GPIO.port[0].pvr) & 0x0FF);
	NOP_OPERATION;
	AVR32_GPIO.port[0].ovrs = __AVR32_USB_RD;
	NOP_OPERATION;
	
	// Clear A0
	AVR32_GPIO.port[2].ovrc =  __AVR32_USB_A0;
	NOP_OPERATION;
	
	// Restore state
	AVR32_GPIO.port[0].oder = (AVR32_GPIO.port[0].oder & 0x0FFFFFF00) | iActualPortState;
	NOP_OPERATION;
	
	// Return the value
	return iRetVal;
}

volatile char __AVR32_USB_GetData(char* iData, char iMaxCount)
{
	// Return if we're zero
	if (iMaxCount == 0) return 0;
	
	// Write data...
	AVR32_GPIO.port[0].oderc =  __AVR32_USB_AD0 | __AVR32_USB_AD1 |	__AVR32_USB_AD2 | __AVR32_USB_AD3 |
								__AVR32_USB_AD4 | __AVR32_USB_AD5 |	__AVR32_USB_AD6 | __AVR32_USB_AD7 ;
	NOP_OPERATION;
	// Clear A0
	AVR32_GPIO.port[2].ovrc =  __AVR32_USB_A0;
	NOP_OPERATION;
	
	// Write as many bytes as needed
	volatile unsigned int i_total_read = 0;
	for (unsigned int vx = 0; vx < iMaxCount; vx++)
	{
		// Is there data?
		if (USB_inbound_USB_data() == FALSE) break;
		
		// Get the value
		NOP_OPERATION;
		AVR32_GPIO.port[0].ovrc = __AVR32_USB_RD;
		NOP_OPERATION;
		iData[vx]  = ((AVR32_GPIO.port[0].pvr) & 0x0FF);
		AVR32_GPIO.port[0].ovrs = __AVR32_USB_RD;
		NOP_OPERATION;
		
		// Increase our total read count
		i_total_read++;
	}
	
	return i_total_read;
}

volatile void __AVR32_USB_FlushInputData()
{
	// Write data...
	AVR32_GPIO.port[0].oderc =  __AVR32_USB_AD0 | __AVR32_USB_AD1 |	__AVR32_USB_AD2 | __AVR32_USB_AD3 |
								__AVR32_USB_AD4 | __AVR32_USB_AD5 |	__AVR32_USB_AD6 | __AVR32_USB_AD7;

	// Write as many bytes as needed
	while ((__AVR32_USB_GetInformation() & 0b01) == 0b01)
	{
		// Get the value
		AVR32_GPIO.port[0].ovrc = __AVR32_USB_RD;
		NOP_OPERATION;
		AVR32_GPIO.port[0].ovrs = __AVR32_USB_RD;
		NOP_OPERATION;
	}
}

volatile void __AVR32_USB_FlushOutputData()
{
	// Set A0
	AVR32_GPIO.port[2].ovrs =  __AVR32_USB_SIWUA;
	NOP_OPERATION;
	AVR32_GPIO.port[2].ovrc =  __AVR32_USB_SIWUA;
	NOP_OPERATION;
}

////////////////////////////////////////////
// CHAIN Functions
////////////////////////////////////////////
void __AVR32_CPLD_Initialize()
{
	// Enable GPIOs on Port A
	AVR32_GPIO.port[1].oderc =  __AVR32_CPLD_BUS_ALL | __AVR32_CPLD_RES0 |  __AVR32_CPLD_RES1; // Disable bus output for this time...
	NOP_OPERATION;
	AVR32_GPIO.port[1].gpers =  __AVR32_CPLD_BUS_ALL | __AVR32_CPLD_ADRS | 	__AVR32_CPLD_OE | __AVR32_CPLD_RES0 | __AVR32_CPLD_RES1;
	NOP_OPERATION;
	AVR32_GPIO.port[1].oders =  __AVR32_CPLD_ADRS    | __AVR32_CPLD_OE;
	NOP_OPERATION;
	AVR32_GPIO.port[0].gpers =  __AVR32_CPLD_CS		 | __AVR32_CPLD_STROBE;
	NOP_OPERATION;
	AVR32_GPIO.port[0].oders =  __AVR32_CPLD_CS		 | __AVR32_CPLD_STROBE;
	NOP_OPERATION;
	
	// Deselect CPLD and deactivate OE
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_OE;
	NOP_OPERATION;
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_CS;
	NOP_OPERATION;
	
	// We activate address-increase pin and de-assert it
	AVR32_GPIO.port[1].oders = __AVR32_CPLD_INCREASE_ADDRESS;
	NOP_OPERATION;
	AVR32_GPIO.port[1].gpers = __AVR32_CPLD_INCREASE_ADDRESS;	
	NOP_OPERATION;
	AVR32_GPIO.port[1].ovrc  = __AVR32_CPLD_INCREASE_ADDRESS;
	NOP_OPERATION;
}

inline void __AVR32_CPLD_SetAccess()
{
	// Nothing needed, the bus is not multiplexed here...
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_CS; // Activate CS and leave it active...
}

inline void __AVR32_CPLD_Write (char iAdrs, char iData)
{
	// Disable CPLDs OE and Select the chip
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_OE;
	
	// Activate bus output first AND set the ADRS pin
	AVR32_GPIO.port[1].oders = __AVR32_CPLD_BUS_ALL;
	
	// Set address
	AVR32_GPIO.port[1].ovrs = __AVR32_CPLD_ADRS;
	AVR32_GPIO.port[1].ovr  = (AVR32_GPIO.port[1].ovr & 0x0FFFFFF00) | iAdrs;
	
	// Strobe
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;
	
	// Set Data and disable address
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_ADRS;
	AVR32_GPIO.port[1].ovr  = (AVR32_GPIO.port[1].ovr & 0x0FFFFFF00) | iData;
	
	// Write data
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;
	
	// Ok now disable output bus
	AVR32_GPIO.port[1].oderc = __AVR32_CPLD_BUS_ALL;
}

