luke-jr/BitForce_SC/BitForce_SC/AVR32X/AVR32_Module.c
inline void __AVR32_CPLD_StartTX(char iTxControlValue)
{
	// Disable CPLDs OE and Select the chip
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_OE;

	// Activate bus output first AND set the ADRS pin
	AVR32_GPIO.port[1].oders = __AVR32_CPLD_BUS_ALL;

	// Set address
	AVR32_GPIO.port[1].ovrs = __AVR32_CPLD_ADRS;
	AVR32_GPIO.port[1].ovr  = (AVR32_GPIO.port[1].ovr & 0x0FFFFFF00) | 34; // 34 is CPLD_TX_ADDRESS_COTROL

	// Strobe
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;

	// Set Data and disable address
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_ADRS;

	// Activate Address-increase
	XLINK_activate_address_increase;

	// Write data
	volatile unsigned int iInitialOvrValue = (AVR32_GPIO.port[1].ovr & 0x0FFFFFF00);
	AVR32_GPIO.port[1].ovr  = (iInitialOvrValue) | iTxControlValue;
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[1].ovr  = (iInitialOvrValue) | 0b01;
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;

	// Disable Address-Increase
	XLINK_deactivate_address_increase;

	// Ok now disable output bus
	AVR32_GPIO.port[1].oderc = __AVR32_CPLD_BUS_ALL;
}


inline void __AVR32_CPLD_BurstTxWrite(char* iData, char iAddress)
{
	// Disable CPLDs OE and Select the chip
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_OE;
	
	// Activate bus output first AND set the ADRS pin
	AVR32_GPIO.port[1].oders = __AVR32_CPLD_BUS_ALL;
	
	// Set address
	AVR32_GPIO.port[1].ovrs = __AVR32_CPLD_ADRS;
	AVR32_GPIO.port[1].ovr  = (AVR32_GPIO.port[1].ovr & 0x0FFFFFF00) | iAddress;
	
	// Strobe
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;
	
	// Set Data and disable address
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_ADRS;
	
	// Activate Address-increase
	XLINK_activate_address_increase;

	// Write data
	volatile unsigned int iInitialOvrValue = (AVR32_GPIO.port[1].ovr & 0x0FFFFFF00);
	AVR32_GPIO.port[1].ovr  = (iInitialOvrValue) | iData[0];
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[1].ovr  = (iInitialOvrValue) | iData[1];
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[1].ovr  = (iInitialOvrValue) | iData[2];
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[1].ovr  = (iInitialOvrValue) | iData[3];
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;	
	
	// Disable Address-Increase
	XLINK_deactivate_address_increase;		
	
	// Ok now disable output bus
	AVR32_GPIO.port[1].oderc = __AVR32_CPLD_BUS_ALL;
}

inline void __AVR32_CPLD_BurstRxRead(char* iData, char iAddress)
{
	// Disable CPLD's OE and Select the chip
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_OE;
	
	// Activate bus output first AND set the ADRS pin
	AVR32_GPIO.port[1].oders = __AVR32_CPLD_BUS_ALL;
	
	// Set address
	AVR32_GPIO.port[1].ovrs = __AVR32_CPLD_ADRS;
	AVR32_GPIO.port[1].ovr  = (AVR32_GPIO.port[1].ovr & 0x0FFFFFF00) | iAddress;
	
	// Strobe
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;
	
	// Disable address
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_ADRS;
	
	// Ok now set bus to input mode
	AVR32_GPIO.port[1].oderc = __AVR32_CPLD_BUS_ALL;
	
	// Activate OE
	AVR32_GPIO.port[1].ovrs = __AVR32_CPLD_OE;
	
	// Activate Address-increase
	XLINK_activate_address_increase;
	
	// Get the result
	iData[0] = (AVR32_GPIO.port[1].pvr & 0x000000FF);
	
	// Strobe
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;
	
	// Get the result
	iData[1] = (AVR32_GPIO.port[1].pvr & 0x000000FF);
	
	// Strobe
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;	
	
	// Get the result
	iData[2] = (AVR32_GPIO.port[1].pvr & 0x000000FF);
	
	// Strobe
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;	
	
	// Get the result
	iData[3] = (AVR32_GPIO.port[1].pvr & 0x000000FF);
	
	// Disable OE
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_OE;
	
	// Disable Address-Increase
	XLINK_deactivate_address_increase;	
	
	// Ok now disable output bus
	AVR32_GPIO.port[1].oderc = __AVR32_CPLD_BUS_ALL;
}

inline unsigned int	__AVR32_CPLD_Read (char iAdrs)
{
	// Disable CPLD's OE and Select the chip
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_OE;
	
	// Activate bus output first AND set the ADRS pin
	AVR32_GPIO.port[1].oders = __AVR32_CPLD_BUS_ALL;
	
	// Set address
	AVR32_GPIO.port[1].ovrs = __AVR32_CPLD_ADRS;
	AVR32_GPIO.port[1].ovr  = (AVR32_GPIO.port[1].ovr & 0x0FFFFFF00) | iAdrs;
	
	// Strobe
	AVR32_GPIO.port[0].ovrs = __AVR32_CPLD_STROBE;
	AVR32_GPIO.port[0].ovrc = __AVR32_CPLD_STROBE;
	
	// Disable address
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_ADRS;
	
	// Ok now set bus to input mode
	AVR32_GPIO.port[1].oderc = __AVR32_CPLD_BUS_ALL;
	
	// Activate OE
	AVR32_GPIO.port[1].ovrs = __AVR32_CPLD_OE;
	
	// Get the result
	volatile int iRetVal = (AVR32_GPIO.port[1].pvr & 0x000000FF);
	
	// Disable OE
	AVR32_GPIO.port[1].ovrc = __AVR32_CPLD_OE;
	
	// Ok now disable output bus
	AVR32_GPIO.port[1].oderc = __AVR32_CPLD_BUS_ALL;
	
	// return data
	return iRetVal;
}

//////////////////////////////////////////////
// SC Chips
//////////////////////////////////////////////
volatile void __AVR32_SC_Initialize()
{
	////////////////// Set SPI1 GPIO settings (Function-A)
	AVR32_GPIO.port[0].gperc = (AVR32_SPI0_PIN1)  |  (AVR32_SPI0_PIN2)  |  (AVR32_SPI0_PIN3);// SPI0_PIN_MISO;
	AVR32_GPIO.port[0].pmr1c = (AVR32_SPI0_PIN1)  |  (AVR32_SPI0_PIN2)  |  (AVR32_SPI0_PIN3);// SPI0_PIN_MOSI;
	AVR32_GPIO.port[0].pmr0c = (AVR32_SPI0_PIN1)  |  (AVR32_SPI0_PIN2)  |  (AVR32_SPI0_PIN3);// SPI0_PIN_SCK;

	AVR32_GPIO.port[0].gpers = AVR32_SPI0_PIN_NPCS;
	AVR32_GPIO.port[0].oders = AVR32_SPI0_PIN_NPCS;
	AVR32_GPIO.port[0].ovrs  = AVR32_SPI0_PIN_NPCS;

	// Activate SPI1
	AVR32_SPI0_CR 	= (1 << 0); // SPIEN = 1
	AVR32_SPI0_MR   = (0b01 | (1<<4)); // MSTR = 1, The rest have their default value... 
	// NOTE: SPI FREQ REDUCED, PLEASE CORRECT FOR PRODUCTION
	AVR32_SPI0_CSR0   = (0b010) | (0b0100 << 8) | (0b01000 << 4); // NPCHA = 1, CPOL = 0 (SPI MODE 0), SCBR = 100 (Clk/4=16MHz), BITS = 1000 (16 Bit mode)	
	
