luke-jr/BitForce_SC/BitForce_SC/AVR32X/AVR32_Module.c
	//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
	// Now, if we are a full-single or a mini-rig, we need to activate second SPI as well
	//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
	#if defined(__PRODUCT_MODEL_SINGLE__) || defined(__PRODUCT_MODEL_MINIRIG__)
		// Set SPI1 GPIO settings (Function-A)
		AVR32_GPIO.port[0].gperc = (AVR32_SPI1_PIN1)  |  (AVR32_SPI1_PIN2)  |  (AVR32_SPI1_PIN3);// SPI1_PIN_MISO;
		AVR32_GPIO.port[0].pmr1c = (AVR32_SPI1_PIN1)  |  (AVR32_SPI1_PIN2)  |  (AVR32_SPI1_PIN3);// SPI1_PIN_MOSI;
		AVR32_GPIO.port[0].pmr0s = (AVR32_SPI1_PIN1)  |  (AVR32_SPI1_PIN2)  |  (AVR32_SPI1_PIN3);// SPI1_PIN_SCK;
		AVR32_GPIO.port[0].gpers = AVR32_SPI1_PIN_NPCS;
		AVR32_GPIO.port[0].oders = AVR32_SPI1_PIN_NPCS;
		AVR32_GPIO.port[0].ovrs  = AVR32_SPI1_PIN_NPCS;
		// Activate SPI1
		AVR32_SPI1_CR 	= (1 << 0); // SPIEN = 1
		AVR32_SPI1_MR   = (0b01 | (1<<4)); // MSTR = 1, The rest have their default value...
		// NOTE: SPI FREQ REDUCED, PLEASE CORRECT FOR PRODUCTION
		AVR32_SPI1_CSR0   = (0b010) | (0b0100 << 8) | (0b01000 << 4); // NPCHA = 1, CPOL = 0 (SPI MODE 0), SCBR = 100 (Clk/4=16MHz), BITS = 1000 (16 Bit mode)			
	#endif	
	
	//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%		
	// Only Jalapeno and Little-Single support DONE pins
	//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
	#if defined(__PRODUCT_MODEL_LITTLE_SINGLE__) || defined(__PRODUCT_MODEL_JALAPENO__)
		// Activate SC_CHIP_DONE
		AVR32_GPIO.port[1].oderc = (AVR32_SC_CHIP_DONE0)  |  (AVR32_SC_CHIP_DONE1)  |  (AVR32_SC_CHIP_DONE2) | (AVR32_SC_CHIP_DONE3) |
								   (AVR32_SC_CHIP_DONE4)  |  (AVR32_SC_CHIP_DONE5)  |  (AVR32_SC_CHIP_DONE6) | (AVR32_SC_CHIP_DONE7) ;
		NOP_OPERATION;
		NOP_OPERATION;
		AVR32_GPIO.port[1].gpers = (AVR32_SC_CHIP_DONE0)  |  (AVR32_SC_CHIP_DONE1)  |  (AVR32_SC_CHIP_DONE2) | (AVR32_SC_CHIP_DONE3) |
								   (AVR32_SC_CHIP_DONE4)  |  (AVR32_SC_CHIP_DONE5)  |  (AVR32_SC_CHIP_DONE6) | (AVR32_SC_CHIP_DONE7) ;
		NOP_OPERATION;
		NOP_OPERATION;
	#endif
}

volatile inline void __AVR32_ASIC_Activate_CS(char iBank)
{
	if (iBank == 1)
	{
		AVR32_GPIO.port[0].ovrc   = AVR32_SPI0_PIN_NPCS;	
	}	
	#if defined(__PRODUCT_MODEL_SINGLE__) || defined(__PRODUCT_MODEL_MINIRIG__)
		if (iBank == 2)
		{
			AVR32_GPIO.port[0].ovrc   = AVR32_SPI1_PIN_NPCS;	
		}		
	#endif
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
}

volatile inline void __AVR32_ASIC_Deactivate_CS(char iBank)
{
	if (iBank == 1)
	{
		AVR32_GPIO.port[0].ovrs   = AVR32_SPI0_PIN_NPCS;	
	}
	
	#if defined(__PRODUCT_MODEL_SINGLE__) || defined(__PRODUCT_MODEL_MINIRIG__)
		if (iBank == 2) 
		{
			AVR32_GPIO.port[0].ovrs   = AVR32_SPI1_PIN_NPCS;
		}			
	#endif
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
}

volatile inline void __AVR32_SPI1_SendWord(unsigned short data)
{
	// Put data in register and wait until its sent
	AVR32_SPI1_TDR = (data & 0x0FFFF);
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	while ((AVR32_SPI1_SR & (1 << 9)) == 0);
}

volatile unsigned short __AVR32_SPI1_ReadWord()
{
	__AVR32_SPI1_SendWord(0x0FFFF); // FF stands for no-care
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	return (AVR32_SPI1_RDR & 0x0FFFF);
}

volatile inline void __AVR32_SPI0_SendWord(unsigned short data)
{
	// Put data in register and wait until its sent
	AVR32_SPI0_TDR = (data & 0x0FFFF);
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	while ((AVR32_SPI0_SR & (1 << 9)) == 0);
}

volatile unsigned short __AVR32_SPI0_ReadWord()
{
	__AVR32_SPI0_SendWord(0x0FFFF); // FF stands for no-care
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	NOP_OPERATION;
	return (AVR32_SPI0_RDR & 0x0FFFF);
}

volatile void	__AVR32_SC_SetAccess()
{
	// Nothing, this is not multiplexed
}

volatile inline unsigned int __AVR32_SC_GetDone  (char iChip)
{
	if (iChip == 0) return ((AVR32_GPIO.port[1].pvr & AVR32_SC_CHIP_DONE0) != 0);
	if (iChip == 1) return ((AVR32_GPIO.port[1].pvr & AVR32_SC_CHIP_DONE1) != 0);
	if (iChip == 2) return ((AVR32_GPIO.port[1].pvr & AVR32_SC_CHIP_DONE2) != 0);
	if (iChip == 3) return ((AVR32_GPIO.port[1].pvr & AVR32_SC_CHIP_DONE3) != 0);
	if (iChip == 4) return ((AVR32_GPIO.port[1].pvr & AVR32_SC_CHIP_DONE4) != 0);
	if (iChip == 5) return ((AVR32_GPIO.port[1].pvr & AVR32_SC_CHIP_DONE5) != 0);
	if (iChip == 6) return ((AVR32_GPIO.port[1].pvr & AVR32_SC_CHIP_DONE6) != 0);
	if (iChip == 7) return ((AVR32_GPIO.port[1].pvr & AVR32_SC_CHIP_DONE7) != 0);
	return FALSE; // SHOULDNT REACH HERE
}

#define MACRO__AVR32_SPI0_SendWord(x) \
		{ \
			AVR32_SPI0_TDR = (x & 0x0FFFF); \
			while ((AVR32_SPI0_SR & (1 << 9)) == 0); \
		}
		
#define MACRO__AVR32_SPI0_SendWord_Express(x) \
		{ \
			AVR32_SPI0_TDR = (x & 0x0FFFF); \
			while ((AVR32_SPI0_SR & (1 << 1)) == 0); \
		}
		
		
#define MACRO__AVR32_SPI0_ReadWord(x) \
		{ \
			MACRO__AVR32_SPI0_SendWord(0x0FFFF); \ 
			x = (AVR32_SPI0_RDR & 0x0FFFF); \
		}		
		
		
// For 16 chip model, using SPI1
#define MACRO__AVR32_SPI1_SendWord(x) \
		{ \
			AVR32_SPI1_TDR = (x & 0x0FFFF); \
			while ((AVR32_SPI1_SR & (1 << 9)) == 0); \
		}

#define MACRO__AVR32_SPI1_SendWord_Express(x) \
		{ \
			AVR32_SPI1_TDR = (x & 0x0FFFF); \
			while ((AVR32_SPI1_SR & (1 << 1)) == 0); \
		}

#define MACRO__AVR32_SPI1_ReadWord(x) \
		{ \
			MACRO__AVR32_SPI1_SendWord(0x0FFFF); \
			x = (AVR32_SPI1_RDR & 0x0FFFF); \
		}		
		

inline unsigned int __AVR32_SC_ReadData (char iChip, char iEngine, unsigned char iAdrs)
{
	unsigned int iCommand = 0;
			
	// Send it via SPI
	#if defined(__PRODUCT_MODEL_SINGLE__) || defined(__PRODUCT_MODEL_MINIRIG__) 
	
