luke-jr/BitForce_SC/BitForce_SC/AVR32X/AVR32_Module.c
		if (iChip < 8)	
		{
			// Generate the command
			iCommand = (ASIC_SPI_RW_COMMAND) |  // RW COMMAND (1 = Read)
						(((unsigned int)(iChip   & 0x0FF) << 12 ) &  0b0111000000000000) | // Chip address
						(((unsigned int)(iEngine & 0x0FF) << 8  ) &  0b0000111100000000) |
						(((unsigned int)(iAdrs   & 0x0FF)       ) &  0b0000000011111111); // Memory Address
						
			__AVR32_SPI0_SendWord(iCommand);
			return (__AVR32_SPI0_ReadWord() & 0x0FFFF);						
		}
		else
		{
			// Generate the command
			iCommand = (ASIC_SPI_RW_COMMAND) |  // RW COMMAND (1 = Read)
						(((unsigned int)((iChip-8)   & 0x0FF) << 12 ) &  0b0111000000000000) | // Chip address
						(((unsigned int)(iEngine & 0x0FF) << 8  ) &  0b0000111100000000) |
						(((unsigned int)(iAdrs   & 0x0FF)       ) &  0b0000000011111111); // Memory Address
						
			// We're on an 16 chip model
			__AVR32_SPI1_SendWord(iCommand);
			return (__AVR32_SPI1_ReadWord() & 0x0FFFF);						
		}
	
		
	#else 
		// Generate the command
		iCommand = (ASIC_SPI_RW_COMMAND) |  // RW COMMAND (1 = Read)
					(((unsigned int)(iChip   & 0x0FF) << 12 ) &  0b0111000000000000) | // Chip address
					(((unsigned int)(iEngine & 0x0FF) << 8  ) &  0b0000111100000000) |
					(((unsigned int)(iAdrs   & 0x0FF)       ) &  0b0000000011111111); // Memory Address
		
		// We're on an 8 chip model
		__AVR32_SPI0_SendWord(iCommand);
		return (__AVR32_SPI0_ReadWord() & 0x0FFFF);		
	#endif
}

inline void __AVR32_SC_WriteData_Express(char iChip, char iEngine, unsigned char iAdrs, unsigned int iData)
{
	unsigned int iCommand = 0;
	
	#if defined(__PRODUCT_MODEL_SINGLE__) || defined(__PRODUCT_MODEL_MINIRIG__)
		// 16 Chip model
		
		// Generate the command
		if (iChip < 8)
		{
			// RW COMMAND (0 = WRITE)
			iCommand = (((unsigned int)(iChip   & 0x0FF) << 12 ) &  0b0111000000000000) | // Chip address
					   (((unsigned int)(iEngine & 0x0FF) << 8  ) &  0b0000111100000000) |
					   (((unsigned int)(iAdrs   & 0x0FF)       ) &  0b0000000011111111); // Memory Address
		
			// Send it via SPI
			MACRO__AVR32_SPI0_SendWord_Express(iCommand);
			MACRO__AVR32_SPI0_SendWord_Express(iData & 0x0FFFF);			
		}
		else
		{
			// RW COMMAND (0 = WRITE)
			iCommand = (((unsigned int)((iChip - 8)   & 0x0FF) << 12 ) &  0b0111000000000000) | // Chip address
					   (((unsigned int)(iEngine & 0x0FF) << 8  ) &  0b0000111100000000) |
					   (((unsigned int)(iAdrs   & 0x0FF)       ) &  0b0000000011111111); // Memory Address
			
			// Send it via SPI
			MACRO__AVR32_SPI1_SendWord_Express(iCommand);
			MACRO__AVR32_SPI1_SendWord_Express(iData & 0x0FFFF);			
		}
	
	#else
		// 8 Chip model
		
		// Generate the command
		// RW COMMAND (0 = WRITE)
		iCommand = (((unsigned int)(iChip   & 0x0FF) << 12 ) &  0b0111000000000000) | // Chip address
		(((unsigned int)(iEngine & 0x0FF) << 8  ) &  0b0000111100000000) |
		(((unsigned int)(iAdrs   & 0x0FF)       ) &  0b0000000011111111); // Memory Address
	
		// Send it via SPI
		MACRO__AVR32_SPI0_SendWord_Express(iCommand);
		MACRO__AVR32_SPI0_SendWord_Express(iData & 0x0FFFF);	
	#endif
	

}

inline void __AVR32_SC_WriteData(char iChip, char iEngine, unsigned char iAdrs, unsigned int iData)
{
	unsigned int iCommand = 0;
	
	#if defined(__PRODUCT_MODEL_SINGLE__) || defined(__PRODUCT_MODEL_MINIRIG__)
		// 16 Chip model
		// Generate the command
		if (iChip < 8)
		{
			// RW COMMAND (0 = WRITE)
			iCommand = (((unsigned int)(iChip   & 0x0FF) << 12 ) &  0b0111000000000000) | // Chip address
					   (((unsigned int)(iEngine & 0x0FF) << 8  ) &  0b0000111100000000) |
					   (((unsigned int)(iAdrs   & 0x0FF)       ) &  0b0000000011111111); // Memory Address
		
			// Send it via SPI
			__AVR32_SPI0_SendWord(iCommand);
			__AVR32_SPI0_SendWord(iData & 0xFFFF);			
		}
		else
		{
			// RW COMMAND (0 = WRITE)
			iCommand = (((unsigned int)((iChip - 8)   & 0x0FF) << 12 ) &  0b0111000000000000) | // Chip address
					   (((unsigned int)(iEngine & 0x0FF) << 8  ) &  0b0000111100000000) |
					   (((unsigned int)(iAdrs   & 0x0FF)       ) &  0b0000000011111111); // Memory Address
			
			// Send it via SPI
			__AVR32_SPI1_SendWord(iCommand);
			__AVR32_SPI1_SendWord(iData & 0xFFFF);			
		}	
	#else
		// Generate the command
		// RW COMMAND (0 = WRITE)
		iCommand = (((unsigned int)(iChip   & 0x0FF) << 12 ) &  0b0111000000000000) | // Chip address
				   (((unsigned int)(iEngine & 0x0FF) << 8  ) &  0b0000111100000000) |
				   (((unsigned int)(iAdrs   & 0x0FF)       ) &  0b0000000011111111); // Memory Address
							  							  
		// Send it via SPI
		__AVR32_SPI0_SendWord(iCommand);
		__AVR32_SPI0_SendWord(iData & 0xFFFF);		
	#endif	
	

}

////////////////////////////////////////////////////
// Main LED
////////////////////////////////////////////////////
#define __AVR32_MAIN_LED_PIN	(1<<18)    // Port A

void	__AVR32_MainLED_Initialize()
{
	// Enable GPIOs on Port A
	AVR32_GPIO.port[0].gpers =  __AVR32_MAIN_LED_PIN;
	AVR32_GPIO.port[0].oders =  __AVR32_MAIN_LED_PIN;
	AVR32_GPIO.port[0].ovrc  =  __AVR32_MAIN_LED_PIN;
}

void	__AVR32_MainLED_Set()
{
	AVR32_GPIO.port[0].ovrs  =  __AVR32_MAIN_LED_PIN;
}

void	__AVR32_MainLED_Reset()
{
	AVR32_GPIO.port[0].ovrc  =  __AVR32_MAIN_LED_PIN;
}

///////////////////////////////////////////////////////
// LEDs
// (Works only with JALAPENO and LittleSingle models)
///////////////////////////////////////////////////////
void	__AVR32_LED_Initialize()
{
	#if defined(__PRODUCT_MODEL_LITTLE_SINGLE__) || defined(__PRODUCT_MODEL_JALAPENO__)
		// Enable GPIOs on Port A
		NOP_OPERATION;
		AVR32_GPIO.port[1].gpers =  __AVR32_ENGINE_LED1 | __AVR32_ENGINE_LED2 |	__AVR32_ENGINE_LED3 | __AVR32_ENGINE_LED4 |
									__AVR32_ENGINE_LED5 | __AVR32_ENGINE_LED6 |	__AVR32_ENGINE_LED7 | __AVR32_ENGINE_LED8 ;
		NOP_OPERATION;
		AVR32_GPIO.port[1].oders =  __AVR32_ENGINE_LED1 | __AVR32_ENGINE_LED2 | __AVR32_ENGINE_LED3 | __AVR32_ENGINE_LED4 |
									__AVR32_ENGINE_LED5 | __AVR32_ENGINE_LED6 |	__AVR32_ENGINE_LED7 | __AVR32_ENGINE_LED8 ;
		NOP_OPERATION;			
	#endif					
}

