luke-jr/BitForce_SC/BitForce_SC/AVR32X/AVR32_Module.c
void	__AVR32_LED_SetAccess()
{
	#if defined(__PRODUCT_MODEL_LITTLE_SINGLE__) || defined(__PRODUCT_MODEL_JALAPENO__)
		// return
	#endif
}

void	__AVR32_LED_Set  (char iLed)
{
	#if defined(__PRODUCT_MODEL_LITTLE_SINGLE__) || defined(__PRODUCT_MODEL_JALAPENO__)
		if (iLed == 1)
			AVR32_GPIO.port[1].ovrs = __AVR32_ENGINE_LED1;
		else if (iLed == 2)
			AVR32_GPIO.port[1].ovrs = __AVR32_ENGINE_LED2;
		else if (iLed == 3)
			AVR32_GPIO.port[1].ovrs = __AVR32_ENGINE_LED3;
		else if (iLed == 4)
			AVR32_GPIO.port[1].ovrs = __AVR32_ENGINE_LED4;
		else if (iLed == 5)
			AVR32_GPIO.port[1].ovrs = __AVR32_ENGINE_LED5;
		else if (iLed == 6)
			AVR32_GPIO.port[1].ovrs = __AVR32_ENGINE_LED6;
		else if (iLed == 7)
			AVR32_GPIO.port[1].ovrs = __AVR32_ENGINE_LED7;
		else if (iLed == 8)
			AVR32_GPIO.port[1].ovrs = __AVR32_ENGINE_LED8;
		
		// IO Sync Delay
		NOP_OPERATION;		
	#endif
}

void	__AVR32_LED_Reset(char iLed)
{
	#if defined(__PRODUCT_MODEL_LITTLE_SINGLE__) || defined(__PRODUCT_MODEL_JALAPENO__)	
		if (iLed == 1)
			AVR32_GPIO.port[1].ovrc = __AVR32_ENGINE_LED1;
		else if (iLed == 2)
			AVR32_GPIO.port[1].ovrc = __AVR32_ENGINE_LED2;
		else if (iLed == 3)
			AVR32_GPIO.port[1].ovrc = __AVR32_ENGINE_LED3;
		else if (iLed == 4)
			AVR32_GPIO.port[1].ovrc = __AVR32_ENGINE_LED4;
		else if (iLed == 5)
			AVR32_GPIO.port[1].ovrc = __AVR32_ENGINE_LED5;
		else if (iLed == 6)
			AVR32_GPIO.port[1].ovrc = __AVR32_ENGINE_LED6;
		else if (iLed == 7)
			AVR32_GPIO.port[1].ovrc = __AVR32_ENGINE_LED7;
		else if (iLed == 8)
			AVR32_GPIO.port[1].ovrc = __AVR32_ENGINE_LED8;
		
		// IO Sync Delay
		NOP_OPERATION;
	#endif
}

/////////////////////////////////////////////
// Timer
/////////////////////////////////////////////

// This function will receiver our Interrupt
ISR(__avr32_tmr0_interrupt, 0, 3)
{
	// Just increase our counter
	MAST_TICK_COUNTER += 0x10000;
	
	// Clear the interrupt.
	volatile unsigned int umx = AVR32_TC.channel[0].sr; // Read the SR flag to clear the interrupt
		
	//AVR32_RTC.val = 0;
	//volatile unsigned long uTop = AVR32_RTC.top;
	/*AVR32_RTC.top = -1;
	while (AVR32_RTC.CTRL.busy); // Wait...	*/
	//AVR32_RTC.ICR.topi = 1 ; // Read the ICR to clear the interrupt
}

void __AVR32_Timer_Initialize()
{
	// Reset master tick counter
	MAST_TICK_COUNTER = 0;

	// Timer0 System
	AVR32_TC.BCR.sync = 0;
	
	AVR32_TC.BMR.tc0xc0s = 0b01;
	AVR32_TC.BMR.tc1xc1s = 0b01;
	AVR32_TC.BMR.tc2xc2s = 0b01;
	
	AVR32_TC.channel[0].CMR.waveform.wave = 1; // Activate Wave-Form mode
	AVR32_TC.channel[0].CMR.waveform.tcclks = 0b011; // TIMER_CLOCK4 , equals PBA Clock / 32 (equals 1us on 32MHz clock)
	AVR32_TC.channel[0].CMR.waveform.wavsel = 0b010; // Reset counter on RC Compare match
	
	AVR32_TC.channel[0].RC.rc = 65535; // Value set to maximum
	
	// Enable interrupt
	AVR32_TC.channel[0].IER.cpcs = 1;
	
	// Activate it
	AVR32_TC.channel[0].CCR.clken = 1;
	AVR32_TC.channel[0].CCR.swtrg = 1;	
	
	// Wait for BUSY to clear
	// Now proceed
	/*
	AVR32_RTC.IER.topi = 1;	
	while (AVR32_RTC.CTRL.busy); // Wait...	
	AVR32_RTC.top = 0x0FFFFFFFF;
	while (AVR32_RTC.CTRL.busy); // Wait...	
	AVR32_RTC.val = 0x0;
	while (AVR32_RTC.CTRL.busy); // Wait...	
	AVR32_RTC.ctrl = (1);
	while (AVR32_RTC.CTRL.busy); // Wait...
	
	// Get the value
	volatile unsigned long umx = 0;
	umx = AVR32_RTC.top;
	*/
		
	// Disable all interrupts first
	Disable_global_interrupt();
	
	// Initialize the intc sw module.
	irq_initialize_vectors();
	
	// Register the TC interrupt handler
	// irq_register_handler(__avr32_tmr0_interrupt, AVR32_RTC_IRQ, 0);
	irq_register_handler(__avr32_tmr0_interrupt, AVR32_TC_IRQ0, 0);
			
    // Enable all interrupts now...
	Enable_global_interrupt();
}

void __AVR32_Timer_SetInterval(unsigned int iPeriod)
{
	// Set the RC compare value
	AVR32_RTC.top = iPeriod; 
}

void __AVR32_Timer_Start()
{
	AVR32_RTC.CTRL.en = 1;
}

void __AVR32_Timer_Stop()
{
	// Enable the Timer
	AVR32_RTC.CTRL.en = 0;
}

int __AVR32_Timer_GetValue()
{
	// Return the RC Value of the timer
	return 	AVR32_TC.channel[0].cv;
}

/////////////////////////////////////////////////
// FAN Controller
/////////////////////////////////////////////////
 void __AVR32_FAN_Initialize()
{
	// Enable GPIOs on Port B
	AVR32_GPIO.port[1].gpers =  __AVR32_FAN_CTRL0 |	__AVR32_FAN_CTRL1 |	__AVR32_FAN_CTRL2 |	__AVR32_FAN_CTRL3;
	AVR32_GPIO.port[1].oders =  __AVR32_FAN_CTRL0 |	__AVR32_FAN_CTRL1 |	__AVR32_FAN_CTRL2 |	__AVR32_FAN_CTRL3;
	AVR32_GPIO.port[1].ovrc  =  __AVR32_FAN_CTRL0 |	__AVR32_FAN_CTRL1 |	__AVR32_FAN_CTRL2 |	__AVR32_FAN_CTRL3;
}

 void __AVR32_FAN_SetAccess()
{
	// nothing special to do
}

 void __AVR32_FAN_SetSpeed(char iSpeed)
{
	volatile unsigned int ovr_value;
	ovr_value = ~( __AVR32_FAN_CTRL3 | __AVR32_FAN_CTRL2 | __AVR32_FAN_CTRL1 | __AVR32_FAN_CTRL0);
	
	volatile unsigned int iFinalVal = AVR32_GPIO.port[1].ovr & ovr_value;
	volatile unsigned int iMXVal = 0;
	
	iMXVal |= (iSpeed & 0b00001) ? __AVR32_FAN_CTRL0 : 0;
	iMXVal |= (iSpeed & 0b00010) ? __AVR32_FAN_CTRL1 : 0;
	iMXVal |= (iSpeed & 0b00100) ? __AVR32_FAN_CTRL2 : 0;
	iMXVal |= (iSpeed & 0b01000) ? __AVR32_FAN_CTRL3 : 0;
	iFinalVal |= iMXVal;
	
	AVR32_GPIO.port[1].ovr = iFinalVal;
}


/////////////////////////////////////////////////
// A2D MUX Controller
// (Works only with MiniRig and Single models)
/////////////////////////////////////////////////
void __AVR32_A2D_MUX_Initialize()
{
	#if defined(__PRODUCT_MODEL_LITTLE_SINGLE__) || defined(__PRODUCT_MODEL_JALAPENO__)
		// Not valid
	#else
		// Enable GPIOs on Port B
		AVR32_GPIO.port[1].gpers =  __AVR32_ADX_MUX0 |	__AVR32_ADX_MUX1 |	__AVR32_ADX_MUX2 |	__AVR32_ADX_MUX3;
		AVR32_GPIO.port[1].oders =  __AVR32_ADX_MUX0 |	__AVR32_ADX_MUX1 |	__AVR32_ADX_MUX2 |	__AVR32_ADX_MUX3;
		AVR32_GPIO.port[1].ovrc  =  __AVR32_ADX_MUX0 |	__AVR32_ADX_MUX1 |	__AVR32_ADX_MUX2 |	__AVR32_ADX_MUX3;	
	#endif
}

void __AVR32_A2D_MUX_SetAccess()
{
	#if defined(__PRODUCT_MODEL_LITTLE_SINGLE__) || defined(__PRODUCT_MODEL_JALAPENO__)
		// Not valid
	#else
		// Nothing to do
	#endif	
}

void __AVR32_A2D_MUX_SelectChannel(int iChannel)
{
	#if defined(__PRODUCT_MODEL_LITTLE_SINGLE__) || defined(__PRODUCT_MODEL_JALAPENO__)
		// Not valid
	#else
		// Extract first 4 bits
		iChannel = iChannel & 0xF;
		
		// Right shift it to reach __AVR32_ADX_MUX0
		iChannel <<= __AVR32_ADX_MUX0;
		
		// Set correct output
		AVR32_GPIO.port[1].ovr = (AVR32_GPIO.port[1].ovr & ~(__AVR32_ADX_MUX0 |	__AVR32_ADX_MUX1 |	__AVR32_ADX_MUX2 |	__AVR32_ADX_MUX3)) | iChannel;
	#endif	
}

