luke-jr/BitForce_SC/BitForce_SC/AVR32X/AVR32_Module.c
int	__AVR32_A2D_MUX_Convert()
{
	#if defined(__PRODUCT_MODEL_LITTLE_SINGLE__) || defined(__PRODUCT_MODEL_JALAPENO__)
		// Not valid	
	#else
		__AVR32_A2D_GetPWR_MAIN(); // A2D MUX OUTPUT is connected to PWR_MAIN for the LITTLE-SINGLE and JALAPENO 
	#endif	
}


/////////////////////////////////////////////////
// Flash programming
/////////////////////////////////////////////////
void		__avr32_flash_writeRegister(uint16_t offset, int32_t value);
int32_t		__avr32_flash_readRegister(uint16_t offset);
void		__avr32_flash_writeUserData(char* szStream);
void		__avr32_flash_readUserData(char* szStream);
void		__avr32_flash_eraseUserData(void);
void		__avr32_flash_waitForFlashReady(void);

//
// Write to Flash Controller register with an offset and value provided
//
volatile void __avr32_flash_writeRegister(uint16_t offset, int32_t value) {
	volatile int32_t *p = (int32_t *)(AVR32_FLASHC_ADDRESS + offset);
	*p = value;
}

//
// Read from Flash Controller register with an offset
//
volatile int32_t __avr32_flash_readRegister(uint16_t offset) {
	volatile int32_t *p = (int32_t *)(AVR32_FLASHC_ADDRESS + offset);
	return *p;
}

//
// Write words into Flash user page
//
volatile void __avr32_flash_writeUserData(char* szStream) {
	// Send Clear Buffer Page command to the Flash controller
	__avr32_flash_writeRegister(AVR32_FLASHC_FCMD, (AVR32_FLASHC_FCMD_KEY_KEY << AVR32_FLASHC_FCMD_KEY_OFFSET) | AVR32_FLASHC_FCMD_CMD_CPB);
	__avr32_flash_waitForFlashReady();
	// Copy data to buffer page
	volatile uint32_t *dst = (uint32_t *)AVR32_FLASHC_USER_PAGE_ADDRESS;
	volatile uint32_t bytes = 512;
	volatile uint32_t word_to_write = 0;
	
	// Now write page-buffer
	for (int x = 0; x < 512; x += 4)
	{
		word_to_write = MAKE_DWORD(szStream[x], szStream[x+1], szStream[x+2],szStream[x+3]);
		*dst++ = word_to_write;
	}
	// Send Write User Page command to the Flash controller
	__avr32_flash_writeRegister(AVR32_FLASHC_FCMD, (AVR32_FLASHC_FCMD_KEY_KEY << AVR32_FLASHC_FCMD_KEY_OFFSET) | AVR32_FLASHC_FCMD_CMD_WUP);
	__avr32_flash_waitForFlashReady();
}

//
// Read words from Flash user page
//
volatile void __avr32_flash_readUserData(char* szStream) {
	// Copy data from buffer page
	volatile uint32_t *src = (uint32_t *)AVR32_FLASHC_USER_PAGE_ADDRESS;
	volatile uint32_t read_word = 0;
	// Now read page-buffer
	for (int x = 0; x < 512; x += 4)
	{
		read_word = *src++;
		szStream[x]   = GET_BYTE_FROM_DWORD(read_word, 3) ;
		szStream[x+1] = GET_BYTE_FROM_DWORD(read_word, 2) ;
		szStream[x+2] = GET_BYTE_FROM_DWORD(read_word, 1) ;
		szStream[x+3] = 
		GET_BYTE_FROM_DWORD(read_word, 0) ;
	}
}

//
// We erase the user-page here
//
volatile void __avr32_flash_eraseUserData(void)
{
	// Send erase-user-page command to the Flash controller
	__avr32_flash_writeRegister(AVR32_FLASHC_FCMD, (AVR32_FLASHC_FCMD_KEY_KEY << AVR32_FLASHC_FCMD_KEY_OFFSET) | AVR32_FLASHC_CMD_EUP);
	__avr32_flash_waitForFlashReady();	
}

//
// Wait for Flash Controller Ready status
//
volatile void __avr32_flash_waitForFlashReady() {
	while (!__avr32_flash_readRegister(AVR32_FLASHC_FSR) & AVR32_FLASHC_FSR_FRDY_MASK);
}


// Main functions
void	__AVR32_Flash_Initialize(void)
{
	// Nothing special here
}

void	__AVR32_Flash_WriteUserPage(char* szData)
{
	// Erase the flash first...
	__avr32_flash_eraseUserData();
	
	// Write...
	__avr32_flash_writeUserData(szData);
}

void	__AVR32_Flash_ReadUserPage (char* szData)
{
	// Write...
	__avr32_flash_readUserData(szData);	
}
